tests/performance/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 2
      name: Warm up
    - duration: 10
      arrivalRate: 10
      name: Sustained load
  environments:
    production:
      target: "https://your-production-url.com"
scenarios:
  - name: "Landing page load"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200